Table of Contents
 Class MaterialStrength
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Strength of material with specific thickness range
[OpenModelClass("IdeaRS.MprlModel.Material.MaterialStrength,CI.BasicTypes")]
public class MaterialStrength : OpenObject
Inheritance
object
OpenObject
MaterialStrength
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Fu
Tension strength
public double Fu { get; set; }
Property Value
double
 Fy
Yield strength
public double Fy { get; set; }
Property Value
double
 MaxThickness
higher value of the thickness range
public double MaxThickness { get; set; }
Property Value
double
 Edit this page